Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/ieee_802_15_4/mwa_end_device_be/mwa_end_device_be.c
                            gState = stateAssociate;
                            OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c);
                        }
                        else
                        {
                            Serial_Print(interfaceId, "Scan did not find a suitable coordinator\n\r", gAllowToBlock_d);
                            
                            /* Restart the Active scan */
                            gState = stateScanPassiveStart;
                            OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c);
                        }
                    }
                }
            }
            break;
            
        case stateAssociate:
            /* Associate to the PAN coordinator */
            Serial_Print(interfaceId, "Associating to PAN coordinator on channel 0x", gAllowToBlock_d);
            Serial_PrintHex(interfaceId, &(mCoordInfo.logicalChannel), 1, gPrtHexNewLine_c);
            
            rc = App_SendAssociateRequest();
            if(rc == errorNoError)
                gState = stateAssociateWaitConfirm;
            break; 
            
        case stateAssociateWaitConfirm:
            /* Stay in this state until the Associate confirm message
            arrives, and then goto the Listen state. */
            if (ev & gAppEvtMessageFromMLME_c)
            {
                if (pMsgIn)
                {   
                    rc = App_WaitMsg(pMsgIn, gMlmeAssociateCnf_c);
                    if(rc == errorNoError)
                    {          
                        rc = App_HandleAssociateConfirm(pMsgIn);
                        if (rc == errorNoError)
                        { 
                            Serial_Print(interfaceId, "Successfully associated with the coordinator.\n\r", gAllowToBlock_d);
                            Serial_Print(interfaceId, "We were assigned the short address 0x", gAllowToBlock_d);
                            Serial_PrintHex(interfaceId, maMyAddress, mAddrMode == gAddrModeShortAddress_c ? 2 : 8, gPrtHexNoFormat_c);
                            Serial_Print(interfaceId, "\n\r\n\rReady to send and receive data over the UART.\n\r\n\r", gAllowToBlock_d);
                            
                            /* Go to the listen state */
                            gState = stateListen;
                            OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c); 
                        }        
                        else 
                        {
                            Serial_Print(interfaceId, "\n\rAssociate Confirm wasn't successful... \n\r\n\r", gAllowToBlock_d);
                            gState = stateScanPassiveStart;
                            OSA_EventSet(mAppEvent, gAppEvtDummyEvent_c);
                        }
                    }
                }
            }
            break; 

        case stateListen:
            /* Transmit to coordinator data received from UART. */
            if (ev & gAppEvtMessageFromMLME_c)
            {  
                if (pMsgIn)
                {  
                    /* Process it */
                    rc = App_HandleMlmeInput(pMsgIn);
                }
            } 

            if (ev & gAppEvtRxFromUart_c)
            {      
                /* get byte from UART */
                App_TransmitUartData();
            }  
            break;
        }

        if (pMsgIn)
        {
            /* Messages must always be freed. */ 
            MSG_Free(pMsgIn);
        }

        /* Handle MCPS confirms and transmit data from UART */
        if (ev & gAppEvtMessageFromMCPS_c)
        {      
            /* Get the message from MCPS */
            pMsgIn = MSG_DeQueue(&mMcpsNwkInputQueue);
            if (pMsgIn)
            {              
                /* Process it */
                App_HandleMcpsInput(pMsgIn);
                /* Messages from the MCPS must always be freed. */
                MSG_Free(pMsgIn);
            }
        }
        
        /* Check for pending messages in the Queue */ 
        if( MSG_Pending(&mMcpsNwkInputQueue) )
            OSA_EventSet(mAppEvent, gAppEvtMessageFromMCPS_c);
        if( MSG_Pending(&mMlmeNwkInputQueue) )
            OSA_EventSet(mAppEvent, gAppEvtMessageFromMLME_c);

        if( !gUseRtos_c )
        {
            break;
        }
    } /* while(1) */
}

/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/

/*****************************************************************************
* UartRxCallBack
*
* This callback is triggered when a new byte is received over the UART
*
*****************************************************************************/
static void UartRxCallBack(void *pData) 
{
  uint8_t pressedKey;
  uint16_t count;
  
  if(stateListen == gState){
    OSA_EventSet(mAppEvent, gAppEvtRxFromUart_c);
  }else{
    Serial_GetByteFromRxBuffer(interfaceId, &pressedKey, &count);
  }
}

/******************************************************************************
* The App_SendSyncRequest() function will try to resyncronize with
* the coordinator by sending a Sync reuqest message
*
* The function may return either of the following values:
*   errorNoError:          The message was sent successfully.
*   errorInvalidParameter: The MLME service access point rejected the
*                          message due to an invalid parameter.
*   errorAllocFailed:      A message buffer could not be allocated.
*
******************************************************************************/
static uint8_t App_SendSyncRequest(void)
{
    mlmeMessage_t *pMsgOut = MSG_AllocType(mlmeMessage_t);

    if(pMsgOut != NULL)
    {
      pMsgOut->msgType = gMlmeSyncReq_c;
      pMsgOut->msgData.syncReq.logicalChannel = mCoordInfo.logicalChannel;
      pMsgOut->msgData.syncReq.trackBeacon = TRUE;

